---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.CategoryId
source: html/e4a3f32e-61a1-3b57-ec1f-5f289bf7c25c.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.CategoryId Property

Category id for this parameter

## Syntax (C#)
```csharp
public ElementId CategoryId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null